<?php 
    include "db_config.php";
   
?>

<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="proj2022.css">
</head>

<body>
    <h1>אנא בחר את הפעולה  שאתה רוצה על פי המספר שלה</h1>
    <ol>
        <h2>שאילתות</h2>
        <li> את כל המוצרים </li>
        <li>הצגת את כל הזמנות ב-איקס שבועות אחרונים</li>
        <li>הצגת את העובד שמכר הכי הרבה מוצרים </li>
        <li>הצגת את העובד שהכניס הכי הרבה כסף </li>
        <li>הצגת הזמנות פעילות והלקוח שהזמין </li>
        <li>הצגת לקוחות שלא ביצעו  אף הזמנה </li>
        <li>הצגת לקוחות חוזרים</li>
        <li>הכנסת איקס חודשים אחורה</li>
        <h2>בחר את הפרוצדרות שאתה רוצה </h2>
        <li>עדכון משלוח להזמנה מעדכנת סיום משלוח להזמנה קיימת</li>
        <li>הצגת וואי מוצרים הנמכרים ביותר באיקס הימים האחרונים </li>
        <li>מתן הנחה באחוזים מעדכן את מחיר ההזמנה לפי גובה ההנחה שינתן באחוזים</li>
        <h4>בהתחלה מחירי הזמנות מעודכנות ל0 לאחר שנפעיל את פרוצדורה מספר 12 המחירים יתעדכנו</h4>
        <li> עדכון של מחירי הזמנה</li>
        <li> עדכון כמות המוצרים לאחר הזמנות</li>
        <h2>בחר את פונקציה  </h2>
        <li>כמות הההכנסות לחודש מסויים</li>
    </ol>

    <form method="GET" action="change.php">
        <input type="number" name="id_query">
        <input type="hidden" name="week_number" value=0>
        <input type="hidden" name="v-change" value=0> 
        <input type="submit">
    </form>
</body>
</html>
